public class While {

    public static void main(String[] args) {


        // taks 2
       /* С помощью цикла while написать программу,
       выводящую на экран результат умножения данного цисла n на все целые числа от 0 до n
      Пример: для числа 3 результат будет 0, 3, 6, 9
        */

        int n = 10;


//        0 * 5 = 0
//        1 * 5 = 5
//        2 * 5 = 10
//        3 * 5 = 15
//        4 * 5 = 20
//        5 * 5 = 25




        int i = 0;
        while (i <=n ) {
            System.out.println(n * i);
            i++;

        }

    }
}
